# Copyright 2014 Adopt OpenJDK.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#      http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

headline=Move to the latest Java today!

intro=15 anni fa nacque un linguaggio di programmazione incredibile. Il suo nome &egrave; Java. Adesso, nel 2014,
il mondo &egrave; cambiato e cos&igrave; Java! &Egrave; tempo di salutare Java 4, 5, e 6. \
Questo sito web &egrave; dedicato all'osservazione del decremento nell'utilizzo di Java 4, 5 e 6 a meno dell'1% mondiale, \
cosicch&egrave; centinaia di milioni di utenti siano pi&ugrave; sicuri e 9-10 milioni di sviluppatori siano pi&ugrave; produttivi.

security.headline=Java Sicuro
security.text=In particolare, Java in the Browser (aka Applets) pu&ograve; avere buchi di sicurezza, quindi bisogna proteggersi. \
<strong>Java su server &egrave; di solito sicuro, ma bisognerebbe aggiornare a prescindere</strong> \
Ecco <a href="https://java.net/projects/adoptopenjdk/downloads/download/64-New-Things-in-Java-7.pptx" style="color: black" target="_blank">64 buone ragioni extra</a> (PPT) per aggiornare a Java 7 oggi!

map.headline=Guara quali nazioni sono aggiornate!

javanet=java.net
oraclecom=otn.oracle.com
javacom=java.com

upgrade.headline=Come posso aggiornare?
upgrade.text=Se utilizzi Java nel browser, <a href="http://www.java.com" style="color: black" target="_blank">aggiorna qui</a>. \
Se utilizzi Java sul server, aggiorna il tuo JRE/JDK \
<a href="http://www.oracle.com/technetwork/java/javase/downloads/index.html" style="color: black" target="_blank">qui</a>.

notready.headline=Non ancora pronto all'aggiornamento?
notready.text=Se per qualche ragione speciale non si &egrave; ancora pronti, Oracle &egrave; pronta a fornire il supporto \
necessario per mantenere business e clienti al sicuro.

latest.headline=Ultime informazioni
latest.text=Java 7u51 avr&agrave; <a href="https://blogs.oracle.com/java-platform-group/entry/new_security_requirements_for_rias>ulteriori funzionalit&agrave; di sicurezza</a>. \
Perfavore contribuite ad assicurare che progetti popolari come ANT <a href="https://issues.apache.org/bugzilla/show_bug.cgi?id=55542">rimangano sicuri</a> osservando \
e sostenendo i loro aggiornamenti. 

about.headline=Informazioni su questo sito

about.text=Questo &egrave;  progetto &egrave; una collaborazione fra \
<a href="http://java-champions.java.net/" target="_blank">Java Champions</a>, \
<a href="http://www.java.net/jugs/java-user-groups" target="_blank">JUG Leaders</a> \
ed il programma <a href="http://adoptopenjdk.java.net" target="_blank">Adopt OpenJDK</a> programme. \
Il suo scopo &egrave; di raccogliere informazioni sullo stato dell'ecosistema Java nel browser, e \
dovrebbe incoraggiare gli utenti ad adottare la pi&ugrave; recente tecnologia Java.

footer.selectlang=Seleziona linguaggio
footer.aboutjava=Informazioni su Java
footer.developerprivacy=Privacy degli sviluppatori
footer.termsofuse=Termini di utilizzo
footer.trademarks=Marchi registrati
footer.disclaimer=Disclaimer
footer.jelastic=Powered by <a href="http://jelastic.com">Jelastic</a>, hosted by <a href="http://www.layershift.com/hosting/jelastic-cloud">Layershift</a>.

layershift.headline=Powered by Layershift, GlassFish and Jelastic!
layershift.text=Layershift &egrave; uno dei pi&ugrave; bei segreti di Internet\u00e2\u0080\u0099s, che lavora dietro le quinte potenziando un numero di marchiconosciuti. Si descrivono come esperti di gestione hosting, e i loro servizi raggiungono 3 continenti.</p><p>Jelastic PaaS si Layershift supporta questo sito. Offre una piattaforma affidabile di hosting per progetti Java and PHP (Ruby - presto) sui tuoi server role-based preconfigurati per  self-scaling. Anche se sono preconfigurati, hai ancora accesso ai file di configurazione per controllo e flessibilit&agrave; extra. </p><p>Layershift include supporto tecnico industry-leading 24x7, backup di, e standard di SLA robusti - senza costi aggiuntivi nascosti. Da' uno sguardo al <a href="http://www.layershift.com/hosting/jelastic-cloud?utm_source=javacountdown&utm_medium=profile&utm_campaign=countdown">trial gratuoto di 14 giorni di Layershift Jelastic trial</a> per risparmiare tempo e denaro sul tuo prossimo progetto.
layershift.j_headline=Jelastic Uses Standard Stacks
layershift.j_text=Piuttosto che provare a ridefinire nuovi standards, la piattaforma Jelastic utilizza un approccio diverso. Fornisce un set di stack software maturo e completamente standard. Questo rende molto pi&ugrave; facile lavorarci su, e significa che il tuo codice standard pu&ograve; essere preso direttamente dal tuo server di dev. e rilasciato senza modifiche. Non &egrave; necessario perdere tempo nel riscrivere per adattarsi a API specifiche o combattere con strane limitazioni della piattaforma. Questa &egrave; semplicit&agrave; di cloud hosting come dovrebbe essere.
layershift.j2_headline=Altamente Scalabile
layershift.j2_text=Aumento di traffico inaspettato? Basso traffico notturno? Non preoccuparti, la piattaforma Jelastic fornisce scalabilit&agrave; verticale a zero-setup, che aggiunge velocemente e automaticamente risorce (couldlets) al tuo ambiente quando &egrave; necessario.</p><p> Con Jelastic, paghi in base alle risorse utilizzate invece che a quelle allocate - una sottile differenza che permette di risparmiare una grossa somma di denaro (alcuni utenti hanno visto risparmi del 50% o pi&ugrave;, solamente cambiando l'hosting dei proprti progetti su Jelastic invece che su un IaaS di base come AWS).</p><p> Puoi anche aggiungere server addizionali con facilit&agrave; per scalabilit&agrave; orizzontale, ed il tuo codice viene auto-rilasciato e bilanciato in maniera trasparente su tutti i server con giusto qualche click.