# Copyright 2014 Adopt OpenJDK.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#      http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

headline=\u041F\u0440\u0435\u0444\u043B\u0435\u0442\u0435 \u0441\u0435 \u043D\u0430 \u043D\u0430\u0458\u043D\u043E\u0432\u0430\u0442\u0430 \u0408\u0430\u0432\u0430 \u0434\u0435\u043D\u0435\u0441\!

intro= \u043F\u0440\u0435\u0434 15 \u0433\u043E\u0434\u0438\u043D\u0438 \u0441\u0435 \u0440\u043E\u0434\u0438 \u0435\u0434\u0435\u043D \u0441\u0443\u043F\u0435\u0440 \u0458\u0430\u043A \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u0441\u043A\u0438 \u0458\u0430\u0437\u0438\u043A. \u041D\u0435\u0433\u043E\u0432\u043E\u0442\u043E \u0438\u043C\u0435 \u0435 \u0408\u0430\u0432\u0430. \u0421\u0435\u0433\u0430 \u0441\u043C\u0435 2014, \u0441\u0432\u0435\u0442\u043E\u0442 \u0441\u0435 \u043F\u0440\u043E\u043C\u0435\u043D\u0443\u0432\u0430 \u0441\u0435\u043A\u043E\u0458 \u0434\u0435\u043D \u0430 \u0441\u043E \u043D\u0435\u0433\u043E \u0438 \u0408\u0430\u0432\u0430\!\
\u0417\u0430 \u0408\u0430\u0432\u0430 \u0432\u0435\u0440\u0437\u0438\u0438\u0442\u0435 4,5 \u0438 6 \u0432\u0440\u0435\u043C\u0435 \u0435 \u0434\u0430 \u043A\u0430\u0436\u0435\u043C\u0435 \u0447\u0430\u043E. \u041E\u0432\u0430\u0430 \u0441\u0442\u0440\u0430\u043D\u0430 \u0435 \u043F\u043E\u0441\u0432\u0435\u0442\u0435\u043D\u0430 \u0437\u0430 \u043F\u0440\u0435\u0433\u043B\u0435\u0434\u0443\u0432\u0430\u045A\u0435 \u043D\u0430 \u043F\u0440\u043E\u0433\u0440\u0435\u0441\u043E\u0442 \u043D\u0430 \u043E\u043F\u0430\u0453\u0430\u045A\u0435 \u043D\u0430 \u043A\u043E\u0440\u0438\u0441\u0442\u0435\u043D\u043E\u0441\u0442\u0430 \u043E\u0434 \u0408\u0430\u0432\u0430 4, 5 \u0438 6 \u043F\u043E\u0434 1% \u043D\u0430 \u0433\u043B\u043E\u0431\u0430\u043B\u043D\u043E \u043D\u0438\u0432\u043E \u0437\u0430 \u0434\u0430 \u043C\u043E\u0436\u0435 \u0434\u0430 \u0432\u0438\u0434\u0438\u043C\u0435 \u043A\u0430\u043A\u043E \u0441\u0442\u043E\u0442\u0438\u0446\u0438 \u043C\u0438\u043B\u0438\u043E\u043D\u0438 \u043A\u043E\u0440\u0438\u0441\u043D\u0438\u0446\u0438 \u0438 9-10 \u043C\u0438\u043B\u0438\u043E\u043D\u0438 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u0435\u0440\u0438 \u0441\u0435 \u043F\u043E \u043F\u0440\u043E\u0434\u0443\u043A\u0442\u0438\u0432\u043D\u0438.

security.headline=\u0411\u0435\u0437\u0431\u0435\u0434\u043D\u0430 \u0408\u0430\u0432\u0430
security.text=\u0408\u0430\u0432\u0430 \u0432\u043E \u0432\u0430\u0448\u0438\u043E\u0442 \u043F\u0440\u0435\u043B\u0438\u0441\u0442\u0443\u0432\u0430\u0447 \u043C\u043E\u0436\u0435 \u0434\u0430 \u0438\u043C\u0430 \u0431\u0435\u0437\u0431\u0435\u0434\u043D\u043E\u0441\u0438 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u0438 \u043F\u0430 \u0442\u0440\u0435\u0431\u0430 \u0434\u0430 \u0441\u0435 \u0437\u0430\u0448\u0442\u0438\u0442\u0438\u0435\! <strong>\u0408\u0430\u0432\u0430 \u043D\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0441\u043A\u0430 \u0441\u0442\u0440\u0430\u043D\u0430 \u0435 \u0433\u0435\u043D\u0435\u0440\u0430\u043B\u043D\u043E \u0431\u0435\u0437\u0431\u0435\u0434\u0435\u043D \u0458\u0430\u0437\u0438\u043A</strong>. \
\u0422\u0443\u043A\u0430 \u043C\u043E\u0436\u0435 \u0434\u0430 \u0432\u0438\u0434\u0438\u0442\u0435 <a href\="https\://java.net/projects/adoptopenjdk/downloads/download/64-New-Things-in-Java-7.pptx" style\="color\: black" target\="_blank">64 \u0435\u043A\u0441\u0442\u0440\u0430 \u0434\u043E\u0431\u0440\u0438 \u043F\u0440\u0438\u0447\u0438\u043D\u0438</a> (PPT) \u0434\u0430 \u0441\u0435 \u043F\u0440\u0435\u0444\u0440\u043B\u0438\u0442\u0435 \u043D\u0430 \u0408\u0430\u0432\u04307 \u0434\u0435\u043D\u0435\u0441\!

map.headline=\u0412\u0438\u0434\u0435\u0442\u0435 \u043A\u043E\u0438 \u0434\u0440\u0436\u0430\u0432\u0438 \u043A\u043E\u0440\u0438\u0441\u0442\u0430\u0442 \u043D\u0430\u0458\u043D\u043E\u0432\u0438 \u0432\u0435\u0440\u0437\u0438\u0438\!

javanet=java.net
oraclecom=otn.oracle.com
javacom=java.com

upgrade.headline=\u041A\u0430\u043A\u043E \u0434\u0430 \u0458\u0430 \u043D\u0430\u0434\u0433\u0440\u0430\u0434\u0430\u043C \u043C\u043E\u0458\u0430\u0442\u0430 \u0408\u0430\u0432\u0430?
upgrade.text=\u0410\u043A\u043E \u043A\u043E\u0440\u0438\u0441\u0442\u0438\u0442\u0435 \u0408\u0430\u0432\u0430 \u0432\u043E \u043F\u0440\u0435\u043B\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u043E\u0442, \u043C\u043E\u0436\u0435 <a href\="http\://www.java.com" style\="color\: black" target\="_blank">  \u043E\u0434 \u0442\u0443\u043A\u0430</a>. \
\u0410\u043A\u043E \u043A\u043E\u0440\u0438\u0441\u0442\u0438\u0442\u0435 \u0408\u0430\u0432\u0430 \u043D\u0430 \u0441\u0435\u0440\u0432\u0435\u0440\u0441\u043A\u0430 \u0441\u0442\u0440\u0430\u043D\u0430 \u0442\u043E\u0433\u0430\u0448 \u043F\u0440\u0435\u0432\u0437\u0435\u043C\u0435\u0442\u0435 \u0433\u043E JRE/JDK \
<a href\="http\://www.oracle.com/technetwork/java/javase/downloads/index.html" style\="color\: black" target\="_blank">\u043E\u0434 \u0442\u0443\u043A\u0430</a>.

notready.headline=\u041D\u0435 \u0441\u0442\u0435 \u043F\u043E\u0434\u0433\u043E\u0442\u0432\u0435\u043D\u0438 \u0434\u0430 \u0441\u0435 \u043F\u0440\u0435\u0444\u0440\u043B\u0438\u0442\u0435?
notready.text=\u0410\u043A\u043E \u043E\u0434 \u043D\u0435\u043A\u043E\u0458\u0430 \u0441\u043F\u0435\u0446\u0438\u0458\u0430\u043B\u043D\u0430 \u043F\u0440\u0438\u0447\u0438\u043D\u0430 \u0440\u0435\u0448\u0438\u0442\u0435 \u0434\u0430 \u043D\u0435 \u0441\u0435 \u043F\u0440\u0435\u0444\u0440\u043B\u0438\u0442\u0435, Oracle \u0435 \u0441\u043F\u0440\u0435\u043C\u0435\u043D \u0434\u0430 \u0432\u0438 \u043E\u0431\u0435\u0437\u0431\u0435\u0434\u0438 \u043F\u043E\u0434\u0440\u0448\u043A\u0430 \u0448\u0442\u043E \u045C\u0435 \u0432\u0438 \u043E\u0432\u043E\u0437\u043C\u043E\u0436\u0438 \u0431\u0435\u0437\u0431\u0435\u0434\u043D\u043E\u0441\u0442 \u043A\u0430\u0458 \u0432\u0430\u0448\u0438\u0442\u0435 \u043A\u043E\u0440\u0438\u0441\u043D\u0438\u0446\u0438 \u0438 \u0432\u0430\u0448\u0438\u043E\u0442 \u0431\u0438\u0437\u043D\u0438\u0441.

latest.headline=\u041D\u0430\u0458\u0434\u0435\u0442\u0435 \u0458\u0430 \u043D\u0430\u0458\u043D\u043E\u0432\u0430\u0442\u0430 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0458\u0430
latest.text=\u0408\u0430\u0432\u0430 7u51 \u045C\u0435 \u0438\u043C\u0430 <a href\="https\://blogs.oracle.com/java-platform-group/entry/new_security_requirements_for_rias> \u0434\u043E\u043F\u043B\u043E\u043D\u0438\u0442\u0435\u043B\u043D\u0438 \u0431\u0435\u0437\u0431\u0435\u0434\u043D\u043E\u0441\u043D\u0438 \u0440\u0435\u0441\u0442\u0440\u0438\u043A\u0446\u0438\u0438</a>. \
\u0412\u0435 \u043C\u043E\u043B\u0438\u043C\u0435 \u0434\u0430 \u0434\u0430 \u043E\u0432\u043E\u0437\u043C\u043E\u0436\u0438\u0442\u0435 \u043F\u043E\u043F\u0443\u043B\u0430\u0440\u043D\u0438\u0442\u0435 \u043F\u0440\u043E\u0435\u043A\u0442\u0438 \u043A\u0430\u043A\u043E ANT <a href\="https\://issues.apache.org/bugzilla/show_bug.cgi?id\=55542">\u0434\u0430 \u043E\u0441\u0442\u0430\u043D\u0430\u0442 \u0441\u0438\u0433\u0443\u0440\u043D\u0438</a>.

about.headline=\u0417\u0430 \u043E\u0432\u0430\u0430 \u0441\u0442\u0440\u0430\u043D\u0430

about.text=\u041E\u0432\u0430 \u0435 \u0437\u0430\u0435\u0434\u043D\u0438\u0447\u043A\u0438 \u043F\u0440\u043E\u0435\u043A\u0442 \u043D\u0430 <a href\="http\://java-champions.java.net/" target\="_blank">\u0408\u0430\u0432\u0430 \u0428\u0430\u043C\u043F\u0438\u043E\u043D\u0438\u0442\u0435</a>, \
<a href\="http\://www.java.net/jugs/java-user-groups" target\="_blank">\u0408\u0423\u0413 \u043B\u0438\u0434\u0435\u0440\u0438\u0442\u0435 </a> \
\u0438  <a href\="http\://adoptopenjdk.java.net" target\="_blank">Adopt OpenJDK</a> \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u0430\u0442\u0430. \
\u0426\u0435\u043B\u0442\u0430 \u0435 \u0434\u0430 \u0441\u0435 \u0441\u043E\u0431\u0435\u0440\u0430\u0442 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0438 \u0437\u0430 \u0438\u0437\u043A\u043E\u0440\u0438\u0441\u0442\u0435\u043D\u043E\u0441\u0442\u0430 \u043D\u0430 \u0408\u0430\u0432\u0430 \u0432\u043E \u043F\u0440\u0435\u043B\u0438\u0441\u0442\u0443\u0432\u0430\u0447\u0438\u0442\u0435 \u0438 \u0434\u0430 \u0433\u0438 \u043D\u0430\u0442\u0435\u0440\u0430 \u043A\u043E\u0440\u0438\u0441\u043D\u0438\u0446\u0438\u0442\u0435 \u043F\u043E\u0447\u0435\u0441\u0442\u043E \u0434\u0430 \u0433\u0438 \u043D\u0430\u0434\u0433\u0440\u0430\u0434\u0443\u0432\u0430\u0430\u0442 \u0432\u0435\u0440\u0437\u0438\u0438\u0442\u0435 \u043D\u0430 \u0408\u0430\u0432\u0430

footer.selectlang=\u041E\u0434\u0431\u0435\u0440\u0435\u0442\u0435 \u0408\u0430\u0437\u0438\u043A
footer.aboutjava=\u0417\u0430 \u0408\u0430\u0432\u0430
footer.developerprivacy=\u041F\u0440\u0438\u0432\u0430\u0442\u043D\u043E\u0441\u0442
footer.termsofuse=\u0423\u0441\u043B\u043E\u0432\u0438 \u0437\u0430 \u043A\u043E\u0440\u0438\u0441\u0442\u0435\u045A\u0435
footer.trademarks=\u0422\u0440\u0435\u0458\u0434\u043C\u0430\u0440\u043A
footer.disclaimer=\u041E\u0431\u0458\u0430\u0432\u0430
footer.jelastic=\u041F\u043E\u043C\u043E\u0433\u043D\u0430\u0442\u043E \u043E\u0434  <a href\="http\://jelastic.com">Jelastic</a>, \u0445\u043E\u0441\u0442\u0438\u0440\u0430\u043D\u043E \u043E\u0434 <a href\="http\://www.layershift.com/hosting/jelastic-cloud">Layershift</a>.

layershift.headline=\u0420\u0430\u0431\u043E\u0442\u0438 \u043D\u0430 by Layershift, GlassFish \u0438 Jelastic\!
layershift.text=
layershift.j_headline=Jelastic \u043A\u043E\u0440\u0438\u0441\u0442\u0438 \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0434\u0435\u043D \u0441\u0442\u0435\u043A
layershift.j_text=
layershift.j2_headline=Highly Scalable
layershift.j2_text=
